"""全局常量与配置。"""
import os

TILE = 16          # 图块原始像素
SCALE = 3          # 全局放大倍数
STILE = TILE * SCALE

VIEW_TW, VIEW_TH = 20, 13                      # 视野内图块数
WIN_W, WIN_H = VIEW_TW * STILE, VIEW_TH * STILE  # 960 x 624
FPS = 60

ROOT = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
SAVE_PATH = os.path.join(ROOT, "save.json")

PLAYER_NAME = "小澄"

# ---- 配色(DP 风格浅蓝 UI) ----
C_UI_BG      = (222, 238, 250)
C_UI_BORDER  = (46, 84, 158)
C_UI_BORDER2 = (140, 180, 230)
C_UI_TEXT    = (32, 36, 52)
C_UI_SHADOW  = (120, 150, 190)
C_MENU_BG    = (240, 248, 255)
C_SELECT     = (255, 224, 120)

C_HP_GREEN  = (70, 190, 90)
C_HP_YELLOW = (235, 200, 60)
C_HP_RED    = (225, 80, 70)
C_EXP_BLUE  = (70, 150, 235)
C_BLACK     = (16, 18, 24)
C_WHITE     = (255, 255, 255)

TYPE_COLOR = {
    "一般": (168, 168, 120), "火": (240, 128, 48),  "水": (104, 144, 240),
    "草": (120, 200, 80),   "电": (248, 208, 48),  "冰": (150, 217, 214),
    "格斗": (192, 48, 40),  "毒": (163, 62, 161),  "地面": (226, 191, 101),
    "飞行": (168, 144, 240),"超能力": (249, 85, 136),"虫": (168, 184, 32),
    "岩石": (182, 160, 86), "幽灵": (112, 88, 152), "龙": (112, 55, 255),
    "恶": (112, 87, 70),    "钢": (183, 183, 206), "妖精": (238, 153, 172),
}
